import {FC, type ReactNode} from 'react';

import BlockTitle from '@modules/common/components/BlockTitle';
import SplitBlocks from '@modules/common/components/SplitBlocks';
import {COMPANY_ADDRESS, COMPANY_EMAIL, COMPANY_PHONE} from "@utils/const";
import s from './About.module.scss';

const About: FC<{
	children?: ReactNode;
}> = ({children}) => {
	return (
		<section id="about" className={s.container}>
			<BlockTitle title="Про компанію"/>

			<SplitBlocks title="Відомості про фінансову установу" titleType="heading"
			             anchor="reports">
				<p><strong>Повне найменування юридичної особи
					(небанківської фінансової установи)</strong></p>
				<p>ТОВАРИСТВО З ОБМЕЖЕНОЮ ВІДПОВІДАЛЬНІСТЮ «СИСТЕМНИЙ ФІНАНСОВИЙ
					КОНСАЛТИНГ» (далі – Товариство або Установа)</p>

				<h4>Скорочена назва ТОВ</h4>
				<p>«СИСТЕМНИЙ ФІНАНСОВИЙ КОНСАЛТИНГ»</p>

				<h4>Код ЄДРПОУ</h4>
				<p>42483814</p>

				<h4>Місцезнаходження</h4>
				<p>{COMPANY_ADDRESS}</p>

				<h4>Контактний телефон</h4>
				<p>{COMPANY_PHONE}</p>

				<h4> Усі способи зв&#39;язку доступні для
					захищеної категорії осіб)</h4>
				<p>{COMPANY_PHONE}; {COMPANY_EMAIL}</p>

				<h4>Адреса електронної пошти</h4>
				<p>{COMPANY_EMAIL}</p>

				<h4>Режим роботи Установи</h4>
				<p>Робочі дні та
					години: <br/>
					Пн-Чт з 9-00 до 18-00 <br/>
					Пт з 9-00 до 17-00 <br/>
					(крім офіційних святкових і неробочих днів) <br/>
					Години перерви: з 13-00 до 14-00 <br/>
					Вихідні дні: субота, неділя</p>

				<h4>Відомості про державну реєстрацію
					особи, яка надає фінансові послуги</h4>
				<p>дата реєстрації: 19.09.2018 <br/>
					номер запису: 1 071 102 0000 042393</p>

				<h4>Інформація щодо включення Установи до Державного реєстру фінансових
					установ</h4>
				<p>Установу внесено до Державного реєстру фінансових установ згідно із
					Розпорядженням <br/> Нацкомфінпослуг від 19.03.2020 №531
					<br/><br/>
					<a
						href="https://drive.google.com/file/d/11jDjhd-CM-wAL-XtovBUJ0sRg0oEAa4Q/view?usp=sharing"
						target="_blank" rel="noreferrer">Свідоцтво</a> про
					реєстрацію фінансової установи ТОВ «СИСТЕМНИЙ ФІНАНСОВИЙ
					КОНСАЛТИНГ»
					<br/><br/>
					Посилання на реєстраційну картку юридичної особи в
					Комплексно-інформаційній системі
					Національного банку України (далі - КІС НБУ):
					<a href="https://kis.bank.gov.ua/Home/SrchViewIMDetail/30000001106828"
					   target="_blank"
					   rel="noreferrer">https://kis.bank.gov.ua/Home/SrchViewIMDetail/30000001106828</a>
					<br/> <br/> За посиланням КІС НБУ:
					<a href="https://bank.gov.ua/ua/supervision/nonbanks/registers-lists"
					   target="_blank"
					   rel="noreferrer">https://bank.gov.ua/ua/supervision/nonbanks/registers-lists</a>
				</p>

				<h4>Інформація про ліцензії Товариства</h4>

				<p>Національним банком України 20.03.2024 переоформлені ліцензії
					Товариства:</p>
				<ul>
					<li><p>на надання коштів у позику в тому числі на умовах фінансового
						кредиту
						(дата видачі - 01.12.2021);</p></li>
					<li><p>на надання послуг з факторингу (дата видачі - 09.06.2020)</p>
					</li>
				</ul>

				<p>на ліцензію на діяльність фінансової компанії, з правом надання
					фінансових послуг:</p>

				<ul>
					<li><p>НАДАННЯ КОШТІВ ТА БАНКІВСЬКИХ МЕТАЛІВ У КРЕДИТ;</p></li>
					<li><p>ФАКТОРИНГ</p></li>
				</ul>

				<p>Переоформлення ліцензій на підставі пункту 32 розділу VII Закону
					України «Про фінансові послуги та
					фінансові компанії» та пункту 10 додатку 1 до Постанови № 199. Дата
					переоформлення: 20.03.2024.</p>
				<br/>
				<p>Посилання в КІС НБУ на ліцензію Товариства: <br/>
					<a href="https://kis.bank.gov.ua/Home/SrchViewLic/30000001014528"
					   target="_blank"
					   rel="noreferrer">https://kis.bank.gov.ua/Home/SrchViewLic/30000001014528</a>
				</p>
				<p> Рішенням Одноосібного учасника Товариства №03062024-01 від
					03.06.2024
					прийнято рішення про
					припинення з 03.06.2024 послуг з факторингу.</p>
				<p> Товариство подало 06.06.2024 до Національного банку України заяву
					про
					звуження обсягу ліцензії та
					документи до неї, з проханням про виключення з ліцензії на діяльність
					фінансової компанії фінансової
					послуги з факторингу.</p>
				<p>Після отримання відповідного рішення Національного банку України на
					сайті буде актуалізована
					відповідна інформація.</p>

				<h4>Перелік фінансових послуг, що надає/
					має намір надавати Товариство.</h4>
				<ul>
					<li><p>НАДАННЯ КОШТІВ ТА БАНКІВСЬКИХ МЕТАЛІВ У КРЕДИТ. Товариство
						надає кредити фізичним особам-підприємцям, юридичним
						особам. Товариство не здійснює споживче кредитування та не кредитує
						фізичних
						осіб
					</p></li>
					<li><p>
						ФАКТОРИНГ (Рішенням Одноосібного учасника Товариства №03062024-01
						від 03.06.2024
						прийнято рішення про припинення з 03.06.2024 послуг з факторингу;
						документи на
						звуження обсягу ліцензії подано до Національного банку України)
					</p></li>
				</ul>
				<h4>Керівники:</h4>
				<p>Директор <b>(з 16.05.2024)</b></p>
				<p><b>Габіда Дмитро Миколайович</b>, призначено на посаду безстроково, з
					16.05.2024 та протягом періоду

					перебування на посаді</p>

				<p>Директор <b>(по 15.05.2024)</b></p>
				<p><b>Вернигора Олег Олександрович</b>, строк повноважень: з 28.02.2020
					по 15.05.2024</p>

				<p>Головний бухгалтер <b>(з 16.05.2024)</b></p>
				<p><b>Смірнова
					Наталія
					Володимирівна</b>, призначено на посаду безстроково, з 16.05.2024 та
					протягом періоду перебування на посаді</p>

				<p>Головний бухгалтер <b>(по 15.05.2024)</b></p>
				<p><b>Ємельяненко
					Людмила Володимирівна</b>,
					строк повноважень: з 02.06.2023 по 15.05.2024</p>

				<h4>Посилання на структури власності
					Товариства розміщені на сайті НБУ</h4>

				<p><a
					href="https://bank.gov.ua/ua/supervision/licensing-nonbanking/shareholders-nfp/42483814"
					target="_blank"
					rel="noreferrer">https://bank.gov.ua/ua/supervision/licensing-nonbanking/shareholders-nfp/42483814</a>
				</p>

				<h4>Учасники:</h4>
				<p>з 11.06.2024 учасник Товариства</p> <p><b>Шумський Георгій
				Анатолійович</b>,
				Україна, частка володіння в статутному капіталі Товариства – 100%</p>

				<p>по 10.06.2024 учасник Товариства</p> <p><b>Вернигора Олег
				Олександрович</b>,
				Україна,
				частка володіння в статутному капіталі Товариства – 100%</p>
				<br/>
				<p><b>З інформацією про основні показники діяльності Товариства на
					підставі
					поданої до Національного банку України звітності можна
					ознайомитись за гіперпосиланням:</b></p>
				<a
					href="	https://bank.gov.ua/ua/statistic/supervision-statist/data-supervision"
					target="_blank"
					rel="noreferrer"> https://bank.gov.ua/ua/statistic/supervision-statist/data-supervision</a>
			</SplitBlocks>

			<SplitBlocks
				title={`ТОВАРИСТВО З ОБМЕЖЕНОЮ ВІДПОВІДАЛЬНІСТЮ «СИСТЕМНИЙ ФІНАНСОВИЙ КОНСАЛТИНГ», код ЄДРПОУ 42483814 (надалі - «Товариство»)`}
				titleType="text"
			>
				<ul>
					<li><p>надає фінансову послугу з надання коштів та банківських металів
						у кредит виключно в
						частині надання коштів у кредит юридичним особам та фізичним особам
						– підприємцям,
						фізичним особам які провадять незалежну професійну діяльність;</p>
					</li>
					<li><p>не надає споживчі кредити та не здійснює споживче
						кредитування;</p></li>
					<li><p>не здійснює врегулювання простроченої заборгованості споживачів
						(у зв’язку з відсутністю
						такої заборгованості);</p></li>
					<li><p>припинено надання Товариством послуг факторингу з
						03.06.2024.</p></li>
				</ul>
			</SplitBlocks>

			{children}
		</section>
	);
};

export default About;
